artillery.yml
config:
  name: "WILL_THIS_EVER_WORK_________"
  target: "https://blazedemo.com/index.php"
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        timeout: 60000
  # Combined processor with multiple scenarios
  processor: "./tests/artillery/processor.js"
  # # Enable intermediate reporting for per-period metrics
  # ensure:
  #   thresholds: true
  # Report metrics every 10 seconds
  statsInterval: 10
  phases:
    - name: Ramp-up for local test
      duration: 2060
      arrivalRate: 1
      rampTo: 3
    - name: Steady state local test
      duration: 120 # Run for 2 minutes at steady load
      arrivalRate: 3
      # This arrival rate (3 per second) keeps concurrency low enough for your PC
    - name: Ramp-down
      duration: 40
      arrivalRate: 3
      rampTo: 0

scenarios:
  # ============================================================================
  # SCENARIO 1: Original Test (uses helper functions)
  # ============================================================================
  - name: testScenario
    engine: "playwright"
    flowFunction: "artilleryScript"
    custom:
      testName: "Webstore_and_Flight_Search_Performance_Test"
    weight: 1 # Equal weight distribution

  # ============================================================================
  # SCENARIO 2: Comprehensive Flight Search Performance Test
  # ============================================================================
  - name: flightSearchPerformance
    engine: "playwright"
    flowFunction: "flightSearchPerformance"
    custom:
      testName: "Webstore_and_Flight_Search_Performance_Test"
    weight: 1 # Equal weight distribution

  # ============================================================================
  # SCENARIO 3: Vacation Page Load Performance Test
  # ============================================================================
  - name: vacationPagePerformance
    engine: "playwright"
    flowFunction: "vacationPagePerformance"
    custom:
      testName: "Webstore and Flight Search Performance Test"
    weight: 1 # Equal weight distribution